In [53]:
from sklearn.feature_selection import chi2
import seaborn as sns
import numpy as np
import pandas as pd

In [54]:
df = sns.load_dataset('titanic')

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [56]:
cat_df = df.select_dtypes(include = 'object')

In [57]:
cat_df.drop(['who','embark_town'], axis = 1, inplace = True)

In [58]:
cat_df

        sex embarked alive
0      male        S    no
1    female        C   yes
2    female        S   yes
3    female        S   yes
4      male        S    no
..      ...      ...   ...
886    male        S    no
887  female        S   yes
888  female        S    no
889    male        C   yes
890    male        Q    no

[891 rows x 3 columns]

In [59]:
cat_df['sex'] = np.where(cat_df['sex']== 'male',1,0)
cat_df['sex']

0      1
1      0
2      0
3      0
4      1
      ..
886    1
887    0
888    0
889    1
890    1
Name: sex, Length: 891, dtype: int32

In [68]:
cat_df['embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [77]:
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()
cat_df['embarked'] = encoder.fit_transform(df[['embarked']])

C:\Users\amil\anaconda3\Lib\site-packages\sklearn\preprocessing\_label.py:116: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

In [78]:
cat_df['emabarked'] = cat_df['embarked'].fillna(0)

In [80]:
cat_df
cat_df['alive'] = np.where(cat_df['alive']== 'Yes',1,0)

In [81]:
cat_df

     sex  embarked  alive  emabarked
0      1         2      0          2
1      0         0      0          0
2      0         2      0          2
3      0         2      0          2
4      1         2      0          2
..   ...       ...    ...        ...
886    1         2      0          2
887    0         2      0          2
888    0         2      0          2
889    1         0      0          0
890    1         1      0          1

[891 rows x 4 columns]

In [82]:
# chi2 return two values like f_score and p_value
f_p_values = chi2(cat_df,df['survived'])

In [84]:
p_value = pd.Series(f_p_values[1])
p_value.index = cat_df.columns

In [85]:
p_value

sex          6.077838e-22
embarked     1.787913e-03
alive                 NaN
emabarked    1.787913e-03
dtype: float64